Repository: Jaska-ITishnik/YuanBot
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru

source: Tekshirish✅
ru: Проверка✅

source: Hali a'zo bo'lmadingiz🤨
ru: Вы еще не являетесь участником🤨

source: Oldin kanallarga a'zo bo'ling👇
ru: Сначала подпишитесь на каналы👇

source: Muvofaqiyatliy☺ qayta /start ni bosing
ru: Успешно☺ Нажмите /start еще раз».

source: 🛫Botni ishga tushirish
ru: 🛫Запустите бота

source: 🇺🇿UZ
ru: 🇺🇿УЗ

source: ✅Tasdiqlaysizmi
ru: ✅Вы подтверждаете

source: ❌Inkor qilish
ru: ❌ Отрицать

source: ✅Ha
ru: ✅ Да

source: ❌Yo'q
ru: ❌Нет

source: 💱Valyuta ayriboshlash(UZS-CNY)
ru: 💱Обмен валюты (UZS-CNY)

source: 🔍Kursni bilish
ru: 🔍Ознакомиться с курсом

source: 🌐Ijtimoiy tarmoqlarimiz
ru: 🌐Наши социальные сети

source: 💸Tranzaksiyalar tarixi
ru: 💸История транзакций

source: 🛠Sozlamalar
ru: 🛠Настройки

source: 🇺🇿 ♻️ 🇷🇺 Tilni almashtirish
ru: 🇺🇿 ♻️ 🇷🇺 Сменить язык

source: 🔙Orqaga
ru: 🔙Назад

source: ✅Tasdiqlash
ru: ✅Подтверждение

source: 💳Humo
ru: 💳Хумо

source: 🗃Uzcard
ru: 🗃Узкарта

source: 📞Telefon
ru: 📞Телефон

source: Til tanlandi
ru: Язык выбран

source: <b>📈 Tranzaksiya raqami</b>: 🔢 {obj} <b>Mijoz:</b> {first_name} <b>Telefon:</b> {phone_number} <b>Yuan miqdori:</b> {cny_amount}¥ <b>UZS miqdori:</b> {uzs_amount} UZS <b>Admin tranzaksiyani tasdiqlaysizmi👇</b>
ru: <b>📈 Номер транзакции</b>: 🔢 {obj} <b>Клиент:</b> {first_name} <b>Телефон:</b> {phone_number} <b>Сумма юань:</b> {cny_amount}¥ <b>Сумма сум:</b> {uzs_amount} сум <b>Администратор подтверждает транзакцию👇</b>

source: ✅Sizning so'rovingiz adminga yuborildi 24 soat gacha ko'rib chiqiladi😊
ru: ✅Ваш запрос отправлен администратору и будет рассмотрен в течение 24 часов😊

source: Bekor qilindi❌
ru: Отменено❌

source: Sizning sorovingiz qabul qilindi😊 To'lovlaringizni to'lovlar tarixidan kuzatishingiz mumkin👇
ru: Ваш запрос принят😊 Вы можете отслеживать свои платежи из истории платежей👇

source: Sizning sorovingiz qabul qilinmadi🥶❌ To'lovlaringizni to'lovlar tarixidan kuzatishingiz mumkin👇
ru: Ваш запрос не принят🥶❌ Вы можете отслеживать свои платежи из истории платежей👇

source: Xatolik yuz berdi Imageni yuklay olmadim: {error}
ru: Произошла ошибка. Не удалось загрузить изображение: {error}.

source: Assalomu aleykum {}
ru: Привет {}

source: Telegram: {}
ru: Телеграм: {}

source: Sozlamalar bo'limiga xush kelibsiz👇
ru: Добро пожаловать в раздел настроек👇

source: <b>📉 So'ngi kurs:</b> 💰1$ 👇<blockquote>{yuan}¥</blockquote> ~-~-~-~-~-~-~-~-~-~-~-~-~-~-~ 💰1$ 👇<blockquote>{soum} UZS</blockquote>
ru: <b>📉 Последний курс:</b> 💰1$ 👇<blockquote>{yuan}¥</blockquote> ~-~-~-~-~-~-~-~-~-~-~-~-~-~-~ 💰1$ 👇<blockquote>{soum} сум</blockquote>

source: Summani qaysi valyutada kiritasiz?
ru: В какой валюте вы вводите сумму?

source: <b>Iltimos oldin ismingizni kiriting Masalan:</b> <i>Abror</i>
ru: <b>Сначала введите свое имя Например:</b> <i>Репутация</i>

source: <b>Telefon nomerni pastdagi tugma orqaliy jo'nating👇</b>
ru: <b>Отправьте номер телефона, используя кнопку ниже👇</b>

source: Davom ettirishingiz mumkin👇
ru: Вы можете продолжить👇

source: Summani yuanda kiriting
ru: Введите сумму в юанях

source: <b>Tranzaksiya miqdori:</b> 💰1$ 👇<blockquote>{yuan}¥</blockquote> ~-~-~-~-~-~-~-~-~-~-~-~-~-~-~ 💰1$ 👇<blockquote>{soum} UZS</blockquote> ~-~-~-~-~-~-~-~-~-~-~-~-~-~-~ <b>📩Qabul qilasiz:</b> <blockquote>{taken_yuan}¥</blockquote> ~-~-~-~-~-~-~-~-~-~-~-~-~-~-~ <b>📤To'laysiz:</b> <blockquote>{payment_amount} UZS</blockquote>
ru: <b>Сумма транзакции:</b> 💰1$ 👇<blockquote>{yuan}¥</blockquote> ~-~-~-~-~-~-~-~-~-~-~-~-~-~-~ 💰1$ 👇<blockquote>{soum} сум</blockquote> ~-~-~-~-~-~-~-~-~-~-~-~-~-~-~ <b>📩Вы принимаете:</b> <blockquote>{taken_yuan}¥</blockquote> ~-~-~-~-~-~-~-~-~-~-~-~-~-~-~ <b>📤Вы заплатите:</b> <blockquote>{payment_amount} сум</blockquote>

source: <b>Iltimos yaroqliy qiymatni kiriting👇:</b> <b>📌Ko'rinishi masalan:</b> <blockquote>10 yoki 10.5</blockquote> <b>📉Minimal qiymat yuanda:</b> <blockquote>{min_yuan}¥</blockquote>
ru: <b>Пожалуйста, введите допустимое значение👇:</b> <b>📌Выглядит так:</b> <blockquote>10 или 10,5</blockquote> <b>📉Минимальная стоимость в юанях:</b> <blockquote>{min_yuan}¥</blockquote>

source: Summani so'mda kiriting
ru: Введите сумму в сумах

source: <b>Iltimos yaroqliy qiymatni kiriting👇:</b> <b>📌Ko'rinishi masalan:</b> <blockquote>30000 yoki 50000</blockquote> <b>📉Minimal qiymat so'mda:</b> <blockquote>{min_som} USD</blockquote>
ru: <b>Пожалуйста, введите допустимое значение👇:</b> <b>📌Выглядит так:</b> <blockquote>30000 или 50000</blockquote> <b>📉Минимальная стоимость в сумах:</b> <blockquote>{min_som} USD</blockquote>

source: To'lov mablag'i: <b>{payment_amount} UZS</b> Kartalardan birini tanlang👇
ru: Сумма платежа: <b>{payment_amount} UZS</b> Выберите одну из карточек👇

source: <b>💰Mablag'</b>: {payment_amount} <b>To'lov uchun karta👇</b> <code>{card_number}</code> <blockquote>Palonchiyev Pistonchi1</blockquote> ⚠❗️Diqqat to'lov qilganingizdan keyin chekni screenshotini yuboring🖼
ru: <b>💰Сумма</b>: {payment_amount} <b>Карта для оплаты👇</b> <code>{card_number}</code> <blockquote>Палончиев Поршнечи1</blockquote> ⚠❗️Пожалуйста, пришлите скриншот квитанции после оплаты🖼

source: AliPay summani olish uchun QR kodni rasmini yuboring
ru: Отправьте изображение QR-кода, чтобы получить сумму AliPay.

source: <b>📈 Tranzaksiya raqami</b>: 🔢 {obj} ~-~-~-~-~-~-~-~-~-~-~-~-~-~-~ <b>📤To'laysiz:</b> <blockquote>{payment_amount} UZS</blockquote> <b>Barcha jarayonlar to'griligini tasdiqlang!</b>
ru: <b>📈 Номер транзакции</b>: 🔢 {obj} ~-~-~-~-~-~-~-~-~-~-~-~-~-~-~ <b>📤Вы заплатите:</b> <blockquote>{payment_amount} сум</blockquote> <b>Проверьте правильность всех процессов!</b>

source: <b>🔢 Tranzaksiya raqami: </b> {transaction_number} <b>Holati:</b> {transaction_status} <b>Yuan:</b> {amount_yuan}¥ <b>UZS:</b> {amount_uzs} UZS <b>📆Sanasi:</b> {transaction_date} <b>⌛Vaqti:</b> {transaction_time}
ru: <b>🔢 Номер транзакции: </b> {transaction_number} <b>Статус:</b> {transaction_status} <b>Юань:</b> {amount_yuan}¥ <b>UZS:</b> {amount_uzs} UZS <b>📆Дата:</b> {transaction_date} <b>⌛Время:</b> {transaction_time}

source: Siz asosiy menyudasiz 👇 birini tanlang
ru: Вы находитесь в главном меню 👇 выберите одного

source: Tillardan birini tanlang👇
ru: Выберите один из языков👇
